1m3_27mm_wall_H2_test_84/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
// nozzle inlet: cut-plane face exposed by subsetMesh
    {
        name    nozzle;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo { patch "nozzleChannel"; }
    }

// bottom_wall: full floor (bore opening is gone after subsetMesh)
    {
        name    bottom_wall;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo { patch "bottom"; }
    }
/*
//create vent_lower
    {
        name    vent_lower;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
            {
                patch "front";
            }
    }
    {
        name    vent_lower;
        type    faceSet;
        action  subset;
        source  boxToFace;
        sourceInfo
            {
                box (0 -0.4976 0) (0.48 -0.4974 0.18);  
            }
    }
//create vent_upper
    {
        name    vent_upper;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
            {
                patch "back";
            }
    }
    {
        name    vent_upper;
        type    faceSet;
        action  subset;
        source  boxToFace;
        sourceInfo
            {
                box  (0 0.4974 0.82) (0.48 0.4976 1);  
            }
    }
*/    
);


// ************************************************************************* //
